[
  {
    "id": 1,
    "cover_photo": "https://i.ibb.co/VwZwQnq/python.png",
    "title": "Introduction to OOP Python",
    "hours": 9,
    "description": "Python is a versatile, high-level programming language known for its readability and simplicity. It's widely used in web development, data analysis, artificial intelligence, and automation due to its extensive libraries and community support.",
    "price": 500.0
  },
  {
    "id": 2,
    "cover_photo": "https://i.ibb.co/4fhrP8m/MySQL.png",
    "title": "Database (MySQL)",
    "hours": 5,
    "description": "MySQL is an open-source relational database management system (RDBMS). It's popular for its speed, reliability, and scalability, making it a top choice for storing and managing structured data in various applications.",
    "price": 490.0
  },
  {
    "id": 3,
    "cover_photo": "https://i.ibb.co/gMt6xvb/Cprogramming.png",
    "title": "Introduction to C Programming",
    "hours": 4,
    "description": "C programming is a versatile, low-level programming language. It's known for its efficiency and portability, making it ideal for system programming, embedded systems, and creating high-performance applications.",
    "price": 200.0
  },
  {
    "id": 4,
    "cover_photo": "https://i.ibb.co/VL3M350/Algorithm.png",
    "title": "Introduction to Algorithms",
    "hours": 1,
    "description": "Algorithms refers to a step-by-step set of instructions for solving a specific problem or performing a task efficiently. Algorithms are fundamental in computer science and underlie all software and computing processes.",
    "price": 600.0
  },
  {
    "id": 5,
    "cover_photo": "https://i.ibb.co/1q6gVHG/C++.png",
    "title": "Introduction to C++ for DSA",
    "hours": 4,
    "description": "C++ is a preferred choice for Data Structures and Algorithms (DSA) due to its efficiency, powerful standard library, and support for object-oriented programming, enabling the creation of optimized and scalable DSA solutions.",
    "price": 150.0
  },
  {
    "id": 6,
    "cover_photo": "https://i.ibb.co/0XPB5dT/Software.png",
    "title": "Software Engineering",
    "hours": 2,
    "description": "Software engineering is a systematic, disciplined approach to designing, developing, and maintaining software systems. It involves requirements analysis, design, coding, testing, and maintenance, aiming for efficient .",
    "price": 250.0
  },
  {
    "id": 7,
    "cover_photo": "https://i.ibb.co/vjNfL6h/Problem-Solving.png",
    "title": "Problem-Solving Part",
    "hours": 8,
    "description": "Problem-solving is a cognitive process of finding solutions to challenges. It involves identifying issues, analyzing options, and selecting the best course of action to achieve desired outcomes, fostering critical thinking and creativity.",
    "price": 900.0
  },
  {
    "id": 8,
    "cover_photo": "https://i.ibb.co/h9XVRJt/DataStructur.png",
    "title": "Basic Data Structures",
    "hours": 3,
    "description": "Basic data structures are fundamental elements in computer science, like arrays and linked lists, used to organize and store data efficiently, enabling various algorithms and efficient program execution.",
    "price": 350.0
  },
  {
    "id": 9,
    "cover_photo": "https://i.ibb.co/d2380DQ/AWS,CloudComputing.png",
    "title": "AWS, Cloud Computing",
    "hours": 6,
    "description": "Cloud computing delivers on-demand computing services, including storage, processing power, and applications, via the internet. It offers scalability, cost-efficiency, transforming how businesses use technology.",
    "price": 200.0
  }
]
